Repository: wpsocio/wptelegram-login
Catalog: languages/wptelegram-login-*.po
Languages: de_de, ru_ru, uk

source: Telegram Login
uk: Telegram Вхід

source: INSTRUCTIONS!
de_de: KONFIGURATIONSANLEITUNG
ru_ru: ИНСТРУКЦИЯ!
uk: ІНСТРУКЦІЇ!

source: Error:
de_de: Fehler:
ru_ru: Ошибка:
uk: Помилка:

source: Telegram User ID
ru_ru: ID Польз. Telegram
uk: Ідентифікатор користувача Telegram

source: With this plugin, you can let the users login to your website with their Telegram and make it simple for them to get connected.
de_de: Mit diesem Plugin können sich Benutzer ganz einfach per Telegram auf einer WordPress-Website registrieren und einloggen.
ru_ru: С помощью этого плагина, вы можете сделать простую авторизацию для ваших пользователей через Telegram.
uk: За допомогою цього плагіна ви можете дозволити користувачам увійти на ваш веб-сайт за допомогою Telegram та спростити їх авторизацію.

source: Any
de_de: Immer anzeigen
ru_ru: Всегда
uk: Будь-який

source: Logged out
de_de: ausgeloggt
ru_ru: Выходит из системы
uk: Вийшов

source: Logged in
de_de: eingeloggt
ru_ru: Входит в систему
uk: Увійшов

source: Default
de_de: Standard
ru_ru: По умолчанию
uk: За замовчуванням

source: Large
de_de: Groß
ru_ru: Большая
uk: Велика

source: Medium
de_de: Mittel
ru_ru: Средняя
uk: Середня

source: Small
de_de: Klein
ru_ru: Маленькая
uk: Мала

source: Button Settings
de_de: Button-Einstellungen
ru_ru: Параметры кнопки
uk: Налаштування кнопки

source: Button Style
de_de: Login-Button Style
ru_ru: Стиль кнопки
uk: Стиль кнопки

source: Show User Photo
de_de: Benutzerfoto anzeigen
ru_ru: Показать фотографию пользователя
uk: Показувати фото користувача

source: Corner Radius
de_de: Eckenradius
ru_ru: Радиус закругления
uk: Кутовий радіус

source: Show if user is
de_de: Anzeigen wenn Benutzer ist
ru_ru: Показать, если пользователь
uk: Показувати, якщо користувач

source: Error message text
de_de: Inhalt der Fehlermeldung
ru_ru: Текст ошибки
uk: Текст повідомлення про помилку

source: Disable Sign up
de_de: Neuanmeldungen deaktivieren
ru_ru: Отключить регистрацию
uk: Вимкнути реєстрацію

source: Hide on default login
de_de: Beim Standard-Login ausblenden
ru_ru: Скрыть кнопку
uk: Приховати на вході WordPress за замовчуванням

source: Redirect to
de_de: Umleiten zu
ru_ru: Перенаправить
uk: Перенаправити на

source: Custom URL
de_de: Benutzerdefinierte URL
ru_ru: Пользовательский URL
uk: Користувацький URL

source: Show error message
de_de: Fehlermeldung anzeigen
ru_ru: Выводить сообщение об ошибке
uk: Показувати повідомлення про помилку

source: User Role
de_de: Benutzerrolle
ru_ru: Роль пользователя
uk: Роль користувача

source: Avatar URL Meta Key
ru_ru: Мета-ключ URL аватара
uk: Мета-ключ URL-адреси аватара

source: Bot Token
de_de: Bot API-Token
ru_ru: Токен бота
uk: Токен Бота

source: Bot Username
de_de: Bot Benutzername
ru_ru: Логин бота
uk: Користувацьке ім'я Бота

source: Button Options
de_de: Login-Button Optionen
ru_ru: Параметры кнопки
uk: Параметри кнопки

source: Display Telegram user profile photo beside button.
de_de: Das Foto aus dem Telegram-Benutzerprofil unter dem Login-Button anzeigen.
ru_ru: Отображать фотографию профиля пользователя Telegram рядом с кнопкой.
uk: Показувати фото профілю користувача Telegram біля кнопки.

source: Leave empty for default.
de_de: Leer lassen für Standardeinstellung.
ru_ru: Оставьте пустым для значния по умолчанию.
uk: Залишити порожнім за замовчуванням.

source: Who can see the login button.
de_de: Wann soll der Login-Button angezeigt werden?
ru_ru: Кто может видеть кнопку входа.
uk: Хто може бачити кнопку входу.

source: Hide the button on default WordPress login/register page.
de_de: Den Login-Button auf der normalen WordPress Login-Seite/Registrierungsseite ausblenden.
ru_ru: Скрыть кнопку на стандартной странице входа/регистрации WordPress.
uk: Приховати кнопку на сторінці входу/реєстрації WordPress за замовчуванням.

source: Display an error message if Telegram is blocked by user's ISP.
de_de: Eine Fehlermeldung anzeigen falls Telegram vom Internetanbieter des Benutzers blockiert wird.
ru_ru: Выводит пользователю сообщение с ошибкой, если его интернет-провайдер блокирует доступ к Telegram.
uk: Показувати повідомлення про помилку, якщо Telegram заблокований провайдером користувача.

source: Create a Bot by sending %1$s command to %2$s.
de_de: Einen Bot erstellen, indem der Befehl %1$s an den %2$s geschickt wird
ru_ru: Создание бота командой %1$s в чате с %2$s
uk: Створіть Бота, відправивши команду %1$s до %2$s.

source: After completing the steps %s will provide you the Bot Token.
de_de: Nachdem die nun folgenden Schritte erledigt wurden, teilt der %s das Bot Token mit.
ru_ru: После выполнения команд, %s пришлет токен вашего бота.
uk: Після виконання кроків %s надасть вам Токен Бота.

source: Copy the token and paste into the Bot Token field below.
de_de: Dieses Bot Token wird nun in das Feld "Bot Token" eingetragen.
ru_ru: Скопируйте токен и вставьте его в поле 'Токен бота' ниже.
uk: Скопіюйте Токен і вставте в поле Токен Бота нижче.

source: For ease, use %s
de_de: Zum einfacheren Kopieren %s benutzen!
ru_ru: Для удобства используйте %s
uk: Для зручності використовуйте %s

source: Send %1$s command to %2$s, select your bot and then send %3$s
de_de: Den Befehl %1$s an den %2$s senden, dann den eigenen Bot auswählen und dann %3$s senden
ru_ru: Свяжите ваш домен (сайта) с ботом, для этого отправьте команду %1$s в чате с %2$s и укажите %3$s
uk: Надішліть команду %1$s до %2$s, виберіть свого Бота і відправте %3$s

source: Test your bot token below and fill in the bot username if not filled automatically.
de_de: Den Bot-Token im Anschluss unten auf dieser Seite testen und den Bot-Benutzernamen eintragen, falls dieser nicht automatisch ausgefüllt wird.
ru_ru: Протестируйте токен нажав кнопку рядом с полем и после этого заполните поле 'Логин бота', если не заполнится автоматически.
uk: Перевірте свій Токен Бота нижче та заповніть користувацьке ім'я Бота, якщо воно не заповнилось автоматично.

source: Hit %s below
de_de: Zum Speichern der Einstellungen %s klicken
ru_ru: Нажмите кнопку %s
uk: Натисніть %s нижче

source: Save Changes
de_de: Einstellungen speichern
ru_ru: Сохранить изменения
uk: Зберегти зміни

source: That's it. You are ready to rock :)
de_de: Das wars! Jetzt kanns losgehen:)
ru_ru: Вот и всё. Удачи с WP Telegram Login! :)
uk: Це воно. Ви готові запалювати :)

source: Homepage
de_de: Startseite
ru_ru: Главная страница
uk: Домашня сторінка

source: Current page
de_de: Auf aktueller Seite bleiben
ru_ru: Текущая страница
uk: Поточна сторінка

source: Login Options
de_de: Login Optionen
ru_ru: Настройки авторизации
uk: Параметри входу

source: If enabled, only the existing users who have connected their Telegram will be able to login.
de_de: Falls aktiviert können sich nur die Benutzer einloggen, die bereits ihren Telegram-Account verbunden haben.
ru_ru: Если этот флажок установлен, то только существующие пользователи, которые уже подключили Telegram, смогут войти в систему.
uk: Якщо встановлено прапорець, лише існуючі користувачі, які підключили Telegram, зможуть увійти.

source: The default role to assign for the new users.
de_de: Die Benutzerrolle, die automatisch einem neuen Benutzer zugeordnet wird.
ru_ru: Назначаемая роль пользователя по умолчанию.
uk: Роль за замовчуванням для нових користувачів.

source: Redirect location after login.
de_de: Wohin soll der Benutzer nach erfolgreichem Login umgeleitet werden?
ru_ru: Выберите, куда перенаправить пользователя после авторизации.
uk: Місце перенаправлення після входу.

source: The user meta key to be used to save Telegram photo URL.
de_de: Der benutzerdefinierte Meta Key, der verwendet wird, um die Telegram Foto-URL zu speichern.
ru_ru: Пользовательский мета-ключ, который будет использоваться для сохранения URL фото Telegram.
uk: Мета-ключ користувача, який використовується для збереження URL-адреси фото Telegram.

source: Get LIVE support on Telegram
de_de: Erhalte LIVE-Support über Telegram
uk: Отримайте ЖИВУ підтримку у Telegram

source: Telegram Options
de_de: Telegram Optionen
ru_ru: Настройки Telegram
uk: Параметри Telegram

source: Use %s above to set automatically.
de_de: Auf %s klicken, um den Benutzernamen automatisch auszufüllen.
ru_ru: Используйте %s выше для автоматического заполнения.
uk: Використовуйте %s вище для автоматичного встановлення.

source: Test Token
de_de: Token testen
ru_ru: Проверить токен
uk: Перевірити Токен

source: Goto %1$s and click/drag %2$s and place it where you want it to be.
de_de: Im Menüpunkt %1$s kann das %2$s an die passende Stelle im Theme positioniert werden.
ru_ru: Перейдите в %1$s, нажмите / перетащите %2$s и поместите его там, где вы хотите.
uk: Перейдіть на %1$s і натисніть/перетягніть %2$s та розмістіть його там, де ви хочете.

source: Appearance
de_de: Darstellung
ru_ru: Внешний вид
uk: Вигляд

source: Widgets
ru_ru: Виджеты
uk: Віджети

source: Alternately, you can use the below shortcode or the block available in block editor.
de_de: Alternativ kannst du folgenden Shortcode verwenden oder den Block im Blockeditor.
uk: Крім того, ви можете скористатись шорткодом нижче або блоком, доступним у редакторі блоків.

source: Inside page or post content:
de_de: Auf einer Seite oder in einem Beitrag:
ru_ru: Используйте шорткод для отображения кнопки на любой странице WP или странице:
uk: Всередині вмісту сторінки або публікації:

source: Inside the theme templates
de_de: In Theme-Vorlagen
ru_ru: Или используйте тег шаблона для отображения кнопки в любом месте шаблона темы:
uk: Всередині шаблонів тем

source: or
de_de: oder
ru_ru: или
uk: або

source: Please read the instructions above.
de_de: Bitte die Konfigurationsanleitung oben beachten.
ru_ru: Пожалуйста, ознакомьтесь с инструкциями выше.
uk: Будь ласка, прочитайте інструкції вище.

source: Do you like %s?
de_de: Gefällt dir %s?
uk: Вам подобається %s?

source: Need help?
de_de: Hilfe?
ru_ru: Нужна помощь?
uk: Потрібна допомога?

source: Test Result:
de_de: Testresultat:
uk: Результати тесту:

source: Follow %s
de_de: Folge %s
uk: Слідкуйте за %s

source: Join %s
de_de: Tritt %s bei
uk: Приєднуйтесь до %s

source: Widget Info
de_de: Widget-Informationen
ru_ru: Вывод виджета кнопки
uk: Інформація віджета

source: Please wait…
de_de: Bitte warten...
uk: Будь ласка, зачекайте...

source: Could not connect
de_de: Verbindung konnte nicht hergestellt werden
ru_ru: Не удалось подключиться
uk: Не вдається підключитися

source: Changes saved successfully.
de_de: Die Änderungen wurden erfolgreich gespeichert.
uk: Зміни успішно збережено.

source: Invalid %s
de_de: %s ungültig
ru_ru: Некорректный %s
uk: Невірний %s

source: %s required.
de_de: %s wird benötigt.
uk: %s є обов'язковим.

source: Changes could not be saved.
de_de: Die Änderungen konnten nicht gespeichert werden.
uk: Не вдається зберегти зміни.

source: Unauthorized! Data is NOT from Telegram
de_de: Unautorisiert! Diese Daten stammen NICHT von Telegram
ru_ru: Несанкционированный! Данные НЕ из Telegram
uk: Несанкціоновано! Дані НЕ від Telegram

source: Invalid! The data is outdated
de_de: Ungültig! Die Daten sind abgelaufen/veraltet
ru_ru: Ошибка! Данные устарели
uk: Недійсний! Дані застарілі

source: Invalid! The data is incomplete
de_de: Ungültig! Die Daten sind unvollständig
ru_ru: Ошибка! Данные неполные
uk: Недійсний! Дані неповні

source: The Telegram User ID is already associated with another existing user. Please contact the admin
de_de: Diese Telegram User ID ist bereits mit einem anderen existierenden Benutzer verbunden. Bitte den Administrator kontaktieren
ru_ru: Идентификатор пользователя Telegram уже связан с другой существующей учетной записью. Пожалуйста, свяжитесь с администратором
uk: Ідентифікатор користувача Telegram вже пов'язаний з іншим наявним користувачем. Будь ласка, зверніться до адміністратора

source: Sign up via Telegram is disabled. You must first create an account and connect it to Telegram to be able to use Telegram Login
de_de: Anmelden über Telegram ist deaktiviert. Du musst zuerst einen Account anlegen und mit Telegram verbinden, um Telegram Login verwenden zu können.
ru_ru: Регистрация через Telegram отключена. Вы должны сначала создать учетную запись и подключить к ней Telegram, чтобы иметь возможность входа через Telegram
uk: Реєстрація через Telegram вимкнена. Спочатку потрібно створити обліковий запис і підключити його до Telegram, щоб мати можливість користуватися Telegram Вхід

source: Telegram sign in could not be completed.
de_de: Die Telegram-Anmeldung konnte nicht erfolgreich durchgeführt werden.
ru_ru: Не удалось выполнить вход через Telegram.
uk: Не вдалося увійти в Telegram.

source: Or
de_de: Oder
ru_ru: ИЛИ
uk: або

source: Error loading Telegram Login!
de_de: Fehler beim Laden von Telegram Login!
ru_ru: Ошибка при загрузке Telegram Login
uk: Помилка завантаження Telegram Вхід!

source: May be your ISP blocks Telegram!
de_de: Vielleicht blockiert dein Internetanbieter den Telegram-Messenger!
ru_ru: Возможно, ваш интернет-провайдер блокирует доступ к Telegram
uk: Можливо, ваш провайдер блокує Telegram!

source: Display the Telegram Log in button
de_de: Telegram Login-Button anzeigen
ru_ru: Отображение кнопки входа Telegram
uk: Показувати кнопку входу Telegram

source: Title
de_de: Titel
ru_ru: Заголовок
uk: Заголовок

source: Error Message
de_de: Inhalt der Fehlermeldung.
ru_ru: Сообщение об ошибке

source: Telegram Chat ID
ru_ru: ID Польз. Telegram
